{
  "shared": {
    "view": "Ko'rish"
  },
  "landing": {
    "au": "",
   "welcome": "AZIZ ABITURIYENTLAR!, AKFA UNIVERSITETIGA XUSH KELIBSIZ!",
   "admission_open": "2023-2024 AKADEMIK YILI UCHUN HUJJATLAR QABULI BOSHLANADI",
   "what_directions": "Какие направления у нас есть?",
   "life_au": "Жизнь в Университете AKFA",
   "how_apply": "ARIZA QANDAY YUBORILADI?",
   "login": "Kirish",
   "apply": "ARIZA YUBORISH",
   "semesters": " ta semestr",
   "engineering": "Muhandislik maktabi",
   "business": "Biznes maktabi",
   "medical": "Tibbiyot maktabi",
   "dental": "Stomatologiya maktabi",
   "engineering_desc": "Ta’lim jarayonini yetakchi xalqaro tajribalarga muvofiq tashkil etgan holda, talabalarimizga tadqiqot va ishlanmalarga urg‘u berilgan oliy darajali ta’lim olish tajribasini taklif qilamiz.",
   "business_desc": "Ta’lim olishga yondashuv Garvard biznes-maktabi tajribasidan ilhomlangan holda “keyslarning yechimini topish” usuliga asoslangan. AKFA universiteti Biznes maktabining talabalari xalqaro darajadagi lider va tadbirkorlar sifatida muvaffaqiyatli faoliyatga tayyorlanadi.",
   "medical_desc": "Tibbiyot maktabining missiyasi yetuk amaliy ko‘nikmalarga ega va bemorlarga mehribon professional shifokorlani eng ilg‘or xalqaro tibbiy ta’lim dasturlari asosida tayyorlashdan iborat.",
   "dental_desc": "ADEE (Evropada stomatologik ta’lim assotsiatsiyasi) bilan hamkorligimiz sharofati bilan talabalarimizga eng yaxshi amaliyotlarga asoslangan xalqaro darajadagi dasturni taklif qilamiz. Biz xalqaro tanlovlar, grantlar, talabalar almashinuvi dasturlarida ishtirok etib, raqamli ta’lim olish imkoniyatini taklif qilamiz.",
   "call": "TELEFON",
   "s_life": "Студенческая жизнь",
   "exp_au_life": "Почувствуйте неповторимую студенческую жизнь в Университете АКФА",
   "watch_us": "Смотрите нас",
   "get_scholarship": "O‘ZINGIZ ERISHGAN YUTUQLAR ORQALI BIRINCHI QADAMLARDANOQ GRANT SOHIBIGA AYLANING!",
   "scholarship_title": "Iqtidorli yoshlarni  har tomonlama qo‘llab-quvvatlashning muhimligini anglagan holda AKFA universiteti erishilgan yutuqlar uchun grant taklif qilib, kirish imtihonlari asosida stipendiya dasturi doirasida 100% gacha to‘lovni taqdim qilishi mumkin.",
   "teachers": "BIZNING MUTAXASSISLARIMIZ",
   "try_tutorial": "O‘rganishdan o‘tish",
   "students_think": "ЧТО ДУМАЮТ НАШИ СТУДЕНТЫ:",
   "student_name_1": "Эмиль Исматов",
   "student_position_1": "Студент первого курса Инженерной школы",
   "student_text_1": "Как Президент Студенческого совета, я хотел бы выразить глубокую благодарность всем преподавательскому составу и администрации Университета АКФА за качественную программу обучения и создание такой захватывающей и образовательной среды для нас, студентов. Я горжусь тем, что являюсь студентом Университета АКФА, и благодарен за возможность получить высшее образование в таком замечательном учреждении.",
   "student_name_2": "Саодат Назарова",
   "student_position_2": "Студент первого курса Бизнес-школы",
   "student_text_2": "Я хотел бы выразить свою благодарность Университету АКФА за качественную учебную программу. Я получил уникальный опыт и знания, которые помогут мне в будущей карьере. Мне особенно понравилась возможность прохождения практической подготовки и использование передовых технологий в обучении. Также я хотел бы отметить, что Университет АКФА создает хорошую атмосферу для студентов, желающих расширить свои горизонты и познакомиться с новыми людьми.",
   "address": "Milliy bog‘ ko‘chasi, 264, Toshkent, 111221, O‘zbekiston",
   "email": "Elektron pochta manzili",
   "phone": "Telefon",
   "location": "Manzil",
   "read_more": "BATAFSIL"
  }
}
